tutorials/heatTransfer/buoyantSimpleFoam/externalCoupledCavity/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 1e5;

boundaryField
{
    frontAndBack
    {
        type            calculated;
        value           $internalField;
    }

    topAndBottom
    {
        type            calculated;
        value           $internalField;
    }

    hot
    {
        type            calculated;
        value           $internalField;
    }

    cold
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
